Repository: arlyon/choir
Catalog: lib/l10n/app_*.arb
Languages: nb

source: Archived
nb: Arkivert

source: Work Title
nb: Verk

source: Me
nb: Meg

# noItems
source: No items currently checked out.
nb: Ingen noter er for øyeblikket utlånt.

# noFilterItems
source: No items match the selected filters.
nb: Ingen noter passer med de valgte filtrene.

# scanMusic
source: Scan the QR code on the music booklet.
nb: Skann QR-koden på notene.

# scanPerson
source: Scan the QR code for the person.
nb: Skann QR-koden for personen.

# addPerson
source: Add a new person
nb: Legg til en ny person

# addWork
source: Add a new work
nb: Legg til et nytt verk

# reconnected
source: Reconnected to network.
nb: Koblet til nettverket på nytt.

# disconnected
source: Disconnected from network.
nb: Koblet fra nettverket.

# continueText
source: Continue
nb: Fortsett

# missingItems
source: Either the work or user ID is missing. Please go back and scan both QR codes.
nb: Enten verk- eller bruker-ID mangler. Gå tilbake og skann begge QR-kodene.

# errorLoadingSummary
source: Error loading summary details. Please try again.
nb: Feil ved lasting av sammendrag. Prøv igjen.

source: Finalize
nb: Fullfør

# checkoutSuccess
source: Checkout successful!
nb: Utlån vellykket!

# returnSuccess
source: Return successful!
nb: Retur vellykket!

source: Cancel
nb: Avbryt

source: Apply
nb: Bruk

# archivedItems
source: Archived Items ({count})
nb: Arkiverte elementer ({count})

# archiveEmpty
source: Archive is empty.
nb: Arkivet er tomt.

# scanUserBarcode
source: Scan the QR code for the user.
nb: Skann QR-koden for brukeren.

source: Email (optional)
nb: E-post (valgfritt)

source: Composer (optional)
nb: Komponist (valgfritt)

source: Name
nb: Navn

# pleaseEnterName
source: Please enter a name
nb: Skriv inn et navn

# returning
source: is returning
nb: returnerer

# checkingOut
source: is checking out
nb: låner

source: Search
nb: Søk

# returnItem
source: Return
nb: Returner

# failedToRefresh
source: Failed to refresh data. Check connection or logs.
nb: Kunne ikke oppdatere data. Sjekk tilkobling eller logger.

# failedToExportUsers
source: Failed to export users: {error}
nb: Kunne ikke eksportere brukere: {error}

source: Add New User
nb: Legg til ny bruker

source: User ID
nb: Bruker-ID

# userIdHelper
source: Unique identifier for the user
nb: Unik identifikator for brukeren

# userIdHelperMaxLength
source: Unique identifier for the user (max 15 characters)
nb: Unik identifikator for brukeren (maks 15 tegn)

source: Name (optional)
nb: Navn (valgfritt)

# nameHelper
source: If empty, will use User ID as name
nb: Hvis tom, vil bruker-ID bli brukt som navn

# userIdRequired
source: User ID is required
nb: Bruker-ID er påkrevd

# userCreatedSuccess
source: User "{userId}" created successfully
nb: Bruker "{userId}" opprettet

# failedToCreateUser
source: Failed to create user: {error}
nb: Kunne ikke opprette bruker: {error}

# addUserButton
source: Add User
nb: Legg til bruker

source: Add New Work
nb: Legg til nytt verk

source: Work ID
nb: Verk-ID

# workIdHelper
source: Unique identifier for the work
nb: Unik identifikator for verket

# workIdHelperMaxLength
source: Unique identifier for the work (max 15 characters)
nb: Unik identifikator for verket (maks 15 tegn)

source: Title (optional)
nb: Tittel (valgfritt)

# titleHelper
source: If empty, will use Work ID as title
nb: Hvis tom, vil verk-ID bli brukt som tittel

# workIdRequired
source: Work ID is required
nb: Verk-ID er påkrevd

# workCreatedSuccess
source: Work "{workId}" created successfully
nb: Verk "{workId}" opprettet

# failedToCreateWork
source: Failed to create work: {error}
nb: Kunne ikke opprette verk: {error}

# addWorkButton
source: Add Work
nb: Legg til verk

source: Scan QR Code
nb: Skann QR-kode

source: Print Users List
nb: Skriv ut brukerliste

# addUserTooltip
source: Add User
nb: Legg til bruker

source: Generate Barcode Sheet
nb: Generer strekkodeark

# addWorkTooltip
source: Add Work
nb: Legg til verk

source: Checkouts
nb: Utlån

source: Users
nb: Brukere

source: Works
nb: Verk

source: Search works...
nb: Søk verk...

# instances
source: {count, plural, =1{1 instance} other{{count} instances}}
nb: {count, plural, =1{1 eksemplar} other{{count} eksemplarer}}

# pages
source: {count, plural, =1{1 page} other{{count} pages}}
nb: {count, plural, =1{1 side} other{{count} sider}}

source: Unknown Title
nb: Ukjent tittel

source: Unknown User
nb: Ukjent bruker

source: Unknown Composer
nb: Ukjent komponist

source: Unknown date
nb: Ukjent dato

source: Invalid Date
nb: Ugyldig dato

source: Unknown
nb: Ukjent

# emailLabel
source: Email: {email}
nb: E-post: {email}

# composerLabel
source: Composer: {composer}
nb: Komponist: {composer}

source: Delete User
nb: Slett bruker

# confirmDeleteUser
source: Are you sure you want to delete "{name}"?
nb: Er du sikker på at du vil slette "{name}"?

# userDeletionNotImplemented
source: User deletion not implemented yet
nb: Sletting av bruker er ikke implementert ennå

# failedToDeleteUser
source: Failed to delete user: {error}
nb: Kunne ikke slette bruker: {error}

source: Delete
nb: Slett

source: Delete Work
nb: Slett verk

# confirmDeleteWork
source: Are you sure you want to delete "{title}"?
nb: Er du sikker på at du vil slette "{title}"?

# workDeletionNotImplemented
source: Work deletion not implemented yet
nb: Sletting av verk er ikke implementert ennå

# failedToDeleteWork
source: Failed to delete work: {error}
nb: Kunne ikke slette verk: {error}

source: Barcode for "{title}"
nb: Strekkode for "{title}"

# workIdLabel
source: Work ID: {workId}
nb: Verk-ID: {workId}

# barcodeComingSoon
source: Barcode generation feature coming soon!
nb: Strekkodegenerering kommer snart!

source: Close
nb: Lukk

source: Enter Password
nb: Skriv inn passord

# passwordPrompt
source: Enter your password to access the application:
nb: Skriv inn passordet ditt for å få tilgang til applikasjonen:

source: Password
nb: Passord

source: Unlock
nb: Lås opp

# passwordRequired
source: Password cannot be empty
nb: Passord kan ikke være tomt

source: Confirm Music
nb: Bekreft noter

source: Confirm Person
nb: Bekreft person

source: Summary
nb: Sammendrag

source: Enter Work Details
nb: Skriv inn verkdetaljer

source: Enter User ID
nb: Skriv inn bruker-ID

# workIdExample
source: e.g. WORK123
nb: f.eks. VERK123

source: Instance Number
nb: Eksemplarnummer

# instanceExample
source: e.g. 1
nb: f.eks. 1

# userIdExample
source: e.g. USER123
nb: f.eks. BRUKER123

# instanceRequired
source: Instance number is required
nb: Eksemplarnummer er påkrevd

# instanceInvalidNumber
source: Instance number must be a valid number
nb: Eksemplarnummer må være et gyldig tall

source: Manual Input
nb: Manuell inndata

# errorFetchingWork
source: Error fetching work details: {error}
nb: Feil ved henting av verkdetaljer: {error}

# checkoutFailed
source: Checkout failed: {error}
nb: Utlån mislyktes: {error}

source: Title
nb: Tittel

# pleaseEnterTitle
source: Please enter a title
nb: Skriv inn en tittel

# scannedUserId
source: Scanned User ID: {userId}
nb: Skannet bruker-ID: {userId}

# pdfSavedTo
source: PDF saved to {path}
nb: PDF lagret til {path}

# failedToGeneratePdf
source: Failed to generate PDF: {error}
nb: Kunne ikke generere PDF: {error}
